app/views/games/_tooltip_info.html.erb

SELECT * FROM `developers` INNER JOIN `developers_games` ON `developers`.id = `developers_games`.developer_id WHERE (`developers_games`.game_id = 27 )
---
    <strong>Developer</strong>:
    <% @game_info.developers.each do |d| %>

SELECT * FROM `publishers` INNER JOIN `games_publishers` ON `publishers`.id = `games_publishers`.publisher_id WHERE (`games_publishers`.game_id = 27 )
---
    <strong>Publisher</strong>:
    <% @game_info.publishers.each do |p| %>