app/views/games/show.html.erb

SELECT * FROM `developers` INNER JOIN `developers_games` ON `developers`.id = `developers_games`.developer_id WHERE (`developers_games`.game_id = 27 )
---
          <td>
            <% @game.developers.each do |d| %>

SELECT * FROM `publishers` INNER JOIN `games_publishers` ON `publishers`.id = `games_publishers`.publisher_id WHERE (`games_publishers`.game_id = 27 )
---
          <td>
            <% @game.publishers.each do |p| %>

SELECT * FROM `types` INNER JOIN `games_types` ON `types`.id = `games_types`.type_id WHERE (`games_types`.game_id = 27 )
---
    <% end %>
    <% unless @game.types.empty? %>

SELECT * FROM `genres` INNER JOIN `games_genres` ON `genres`.id = `games_genres`.genre_id WHERE (`games_genres`.game_id = 27 )
---
    <% end %>
    <% unless @game.genres.empty? %>

SELECT COUNT(*) AS count_id FROM `project_leaders` WHERE (`project_leaders`.game_id = 27)
---
    <%= @game.achievements %>
    <% unless @game.project_leaders.empty? %>

SELECT * FROM `features` INNER JOIN `features_games` ON `features`.id = `features_games`.feature_id WHERE (`features_games`.game_id = 27 )
---
    <% end %>
    <% unless @game.features.empty? %>

SELECT * FROM `specifications` INNER JOIN `games_specifications` ON `specifications`.id = `games_specifications`.specification_id WHERE (`games_specifications`.game_id = 27 )
---
    <% end %>
    <% unless @game.specifications.empty? %>

SELECT * FROM `peripherals` INNER JOIN `games_peripherals` ON `peripherals`.id = `games_peripherals`.peripheral_id WHERE (`games_peripherals`.game_id = 27 )
---
    <% end %>
    <% unless @game.peripherals.empty? %>