app/controllers/developers_controller.rb

  def index
    @level = params[:lv]
    @view = params[:action]
    if params[:search]
      @developers = Developer.where("LOWER(name) LIKE ?", "%#{params[:search].downcase}%").limit(10)
    else
      @developers = Developer.order("name asc")
---
SELECT `developers`.* FROM `developers` ORDER BY name asc