app/controllers/games_controller.rb

SELECT `games`.* FROM `games` WHERE (release_date >= '2010-01-01' and release_date <= '2010-12-31') ORDER BY release_date asc, hits desc, main_title asc
SELECT `platforms`.* FROM `platforms` ORDER BY name asc
SELECT `publishers`.* FROM `publishers` ORDER BY name asc
SELECT `developers`.* FROM `developers` ORDER BY name asc
---
  def index
    if params[:search]
      @games = Game.where("LOWER(main_title) LIKE ?", "%#{params[:search].downcase}%").limit(14)
      respond_to do |format|
        format.js
      end
    else
      @title = "Year View"
      @game = Game.new
      @year = params[:year] ? params[:year].to_i : Date.today.year;
      @id = params[:game_id] if params[:game_id]
      @enter_year = true
      @games = Game.where('release_date >= ? and release_date <= ?', "#{@year}-01-01", "#{@year}-12-31").order("release_date asc, hits desc, main_title asc").all
      @platforms = Platform.order("name asc")
      @publishers = Publisher.order("name asc")
      @developers = Developer.order("name asc")

SELECT `games`.* FROM `games` WHERE (release_date >= '2009-01-01' and release_date <= '2009-12-31') ORDER BY release_date asc, hits desc, main_title asc
---
  def other_year
    @game = Game.new
    @year = params[:year] ? params[:year].to_i : Date.today.year;
    @id = params[:game_id] if params[:game_id]
    @enter_year = true
    @games = Game.where('release_date >= ? and release_date <= ?', "#{@year}-01-01", "#{@year}-12-31").order("release_date asc, hits desc, main_title asc").all

SELECT `games`.* FROM `games` ORDER BY main_title asc
---
  def list
    @level = params[:lv]
    @view = params[:action]
    @games = Game.order("main_title asc")

SELECT `games`.* FROM `games` ORDER BY release_date asc
---
  def order_games_list
    @games = Game.order("#{params[:order]} asc")

SELECT `games`.* FROM `games` WHERE (`games`.`id` = 27) LIMIT 1
UPDATE `games` SET `hits` = 37, `updated_at` = '2010-04-27 03:37:21' WHERE (`games`.`id` = 9)
---
  def show
    @game = Game.find(params[:id])
    @game.update_attribute('hits', @game.hits += 1)

SELECT `games`.* FROM `games` WHERE (`games`.`id` = 27) LIMIT 1
SELECT `platforms`.* FROM `platforms`
SELECT `markets`.* FROM `markets`
SELECT `rating_systems`.* FROM `rating_systems` WHERE (market_id = 1) LIMIT 1
SELECT `ratings`.* FROM `ratings` WHERE (rating_system_id = 1) ORDER BY name asc
SELECT `developers`.* FROM `developers` ORDER BY name asc
SELECT `publishers`.* FROM `publishers` WHERE (`publishers`.`name` = 'Sega') LIMIT 1
---
  def new
    @level = params[:lv] + "&"
    index = @level.index("month")
    @month = @level.slice(@level.index("=", index) + 1, @level.index("&", index) - @level.index("=", index) - 1) if index
    index = @level.index("year")
    @year = @level.slice(@level.index("=", index) + 1, @level.index("&", index) - @level.index("=", index) - 1) if index
    index = @level.index("id_diff")
    id_diff = @level.slice(@level.index("=", index) + 1, @level.index("&", index) - @level.index("=", index) - 1) if index
    @level = @level.slice(0,1) if @level.length > 1
    @view = params[:action]
    @title = "Add New Game"
    if id_diff
      game_diff = Game.find(id_diff)
      attributes = { :main_title => game_diff.main_title, :sub_title => game_diff.sub_title, :release_date => game_diff.release_date }
      @view = "new_lite"
      @diff_platform_id = game_diff.id
    end
    @game = attributes ? Game.new(attributes) : Game.new
    @game.publisher_names = game_diff.publisher_names if game_diff
    @date = (@year && @month) ? Date.parse("#{@year}-#{@month}-01") : Date.today
    @platforms = Platform.all
    @markets = Market.all
    rating_system = RatingSystem.where("market_id = ?", @markets.first.id).first
    @ratings = Rating.where("rating_system_id = ?", rating_system.id).order("name asc")
    @developers = Developer.order("name asc").all
    @publishers = Publisher.order("name asc").all

SELECT `platforms`.* FROM `platforms` WHERE (`platforms`.`name` = 'Wii') LIMIT 1
SELECT `games`.* FROM `games` WHERE (main_title = 'Pruebax' and sub_title = 'Pruebay' and platform_id = 1) LIMIT 1
SELECT `games`.* FROM `games` WHERE (`games`.`id` = 9) LIMIT 1
INSERT INTO `different_platforms_games` (`different_platform_id`, `game_id`) VALUES (681, 9)
INSERT INTO `games` (`boxart_file_name`, `created_at`, `description`, `hits`, `local_multi_modes_id`, `local_players`, `main_title`, `market_id`, `online_multi_modes_id`, `online_players`, `platform_id`, `prequel_id`, `rating_id`, `re_release_id`, `release_date`, `release_special_edition`, `remake_id`, `sales`, `sequel_id`, `series_id`, `special_title`, `spinoff`, `sub_title`, `updated_at`) VALUES (NULL, '2010-04-23 17:53:07', NULL, 0, NULL, NULL, 'Pruebax', 1, NULL, NULL, 1, NULL, 6, NULL, '2010-06-01', 0, NULL, NULL, NULL, NULL, NULL, 0, 'Pruebay', '2010-04-23 17:53:07')
---
  def create
    platform = Platform.find_by_name(params[:game][:platform_name])
    @game_exists = Game.where("main_title = ? and sub_title = ? and platform_id = ?", params[:game][:main_title], params[:game][:sub_title], platform.id).first if platform
    @game_diff = Game.find(params[:diff_platform_id]) if params[:diff_platform_id]
    if @game_exists and @game_diff
      for game in @game_exists.different_platforms
        game.different_platforms << @game_diff unless game.different_platforms.exists?(@game_diff) or game == @game_diff

SELECT `publishers`.* FROM `publishers` WHERE (`publishers`.`name` = 'Square Enix') LIMIT 1
---
        @title = "Add New Game"
        @platforms = Platform.all
        @developers = Developer.order("name asc").all
        @publishers = Publisher.order("name asc").all

SELECT `games`.* FROM `games` WHERE (`games`.`id` = 27) LIMIT 1
SELECT `markets`.* FROM `markets`
SELECT `rating_systems`.* FROM `rating_systems` WHERE (market_id = 1) LIMIT 1
SELECT `ratings`.* FROM `ratings` WHERE (rating_system_id = 1) ORDER BY name asc
SELECT `platforms`.* FROM `platforms`
SELECT `developers`.* FROM `developers` ORDER BY name asc
SELECT `publishers`.* FROM `publishers` ORDER BY name asc
---
  def edit
    @level = params[:lv] + "&"
    index = @level.index("id")
    id = @level.slice(@level.index("=", index) + 1, @level.index("&", index) - @level.index("=", index) - 1) if index
    index = @level.index("view")
    view = @level.slice(@level.index("=", index) + 1, @level.index("&", index) - @level.index("=", index) - 1) if index
    @level = @level.slice(0,1) if @level.length > 1
    @view = view ? view : params[:action]
    @title = "Edit Game"
    @game = Game.find(id)
    @date = @game.release_date
    @markets = Market.all
    rating_system = RatingSystem.where("market_id = ?", @markets.first.id).first
    @ratings = Rating.where("rating_system_id = ?", rating_system.id).order("name asc")
    @platforms = Platform.all
    @developers = Developer.order("name asc").all
    @publishers = Publisher.order("name asc").all

SELECT `games`.* FROM `games` WHERE (`games`.`id` = 682) LIMIT 1
UPDATE `games` SET `rating_id` = 3, `updated_at` = '2010-04-23 18:59:09' WHERE (`games`.`id` = 682)
---
  def update
    @game = Game.find(params[:id])
    old_r_y = @game.r_y
    old_r_m = @game.r_m
    old_box = @game.make_boxart_path
    styles = %w(thumb mini medium original)
    if @game.update_attributes(params[:game])

SELECT `games`.* FROM `games` WHERE (`games`.`id` = 27) LIMIT 1
---
  def show_game_tooltip
    @game_info = Game.find(params[:id])