app/controllers/platforms_controller.rb

  def index
    @platforms = Platform.where("LOWER(name) LIKE ?", "%#{params[:search].downcase}%").limit(10)
---
SELECT `platforms`.* FROM `platforms` WHERE (LOWER(name) LIKE '%n%') LIMIT 10