app/controllers/press_controller.rb

SELECT `press`.* FROM `press` WHERE (LOWER(name) LIKE '%ig%')
---
  def index
    @press = Press.where("LOWER(name) LIKE ?", "%#{params[:search].downcase}%")