app/controllers/publishers_controller.rb

  def index
    @level = params[:lv]
    @view = params[:action]
    if params[:search]
      @publishers = Publisher.where("LOWER(name) LIKE ?", "%#{params[:search].downcase}%")
    else
      @publishers = Publisher.order("name asc")
---
SELECT `publishers`.* FROM `publishers` ORDER BY name asc